codeigniter/app/Controllers/Cidades.php

    public function editar($id)
    {
        $data['msg'] = '';
        $data['errors'] = '';
        $data['title'] = 'Editar';
        $cidadesModel = new \App\Models\CidadesModel();
        $cidade = $cidadesModel->find($id);
        if ($this->request->getMethod() === 'post') {
            $cidade->nome = $this->request->getPost('nome');
            $cidade->sigla = $this->request->getPost('sigla');
            $cidade->regioes_id = $this->request->getPost('regioes_id');
            if ($cidadesModel->update($id, $cidade)) {
                $data['msg'] = 'Cidade Atualizada com sucesso!';
            } else {
                $data['errors'] = $cidadesModel->errors();
                $data['msg'] = 'Erro ao Atualizar cidade';
            }
        }
        $regioesModel = new \App\Models\RegioesModel();
        $listaRegioes = $regioesModel->findAll();
---
SELECT *
FROM `cidades`
WHERE `cidades`.`id` = '12'
UPDATE `cidades` SET `nome` = 'Bauru', `sigla` = 'BRU', `ts` = '2022-02-07 10:23:30', `regioes_id` = '53'
WHERE `cidades`.`id` IN ('12')
SELECT *
FROM `regioes`