codeigniter/app/Controllers/Geral.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $usuariosModel = new \App\Models\UsuariosModel();
        $data['usuarios'] = $usuariosModel->find();