app/Controllers/Geral.php

    public function index()
    {
        $usuariosModel = new \App\Models\UsuariosModel();
        $data['usuarios'] = $usuariosModel->find();
---
SELECT *
FROM `usuarios`