app/Controllers/Plantonistas.php

    public function index()
    {
        $plantonistasModel = new \App\Models\PlantonistasModel();
        $data['plantonistas'] = $plantonistasModel->find();
---
SELECT *
FROM `plantonistas`

    public function editar($id)
    {
        $data['msg'] = '';
        $data['errors'] = '';
        $data['title'] = 'Editar';
        $plantonistasModel = new \App\Models\PlantonistasModel();
        $plantonista = $plantonistasModel->find($id);
---
SELECT *
FROM `plantonistas`
WHERE `plantonistas`.`id` = '30'