app/Controllers/Plantoes.php

SELECT *
FROM `plantoes`
WHERE `plantoes`.`id` = '24'
SELECT *
FROM `regioes`
SELECT *
FROM `plantonistas`
UPDATE `plantoes` SET `plantonistas_id` = '43', `regioes_id` = '69', `ts` = '2022-05-12 09:59:14'
WHERE `plantoes`.`id` IN ('24')
---
    public function editar($id)
    {
        $this->db = db_connect();
        $data['msg'] = '';
        $data['errors'] = '';
        $data['title'] = 'Editar';
        $plantoesModel = new \App\Models\PlantoesModel();
        $plantao = $plantoesModel->find($id);
        $data['plantao'] = $plantao;

        $regioesModel = new \App\Models\RegioesModel();
        $listaRegioes = $regioesModel->findAll();
        $data['selectRegioes'] = $listaRegioes;

        $plantonistasModel = new \App\Models\PlantonistasModel();
        $listaPlantonistas = $plantonistasModel->findAll();
        $data['selectPlantonistas'] = $listaPlantonistas;

        if ($this->request->getMethod() === 'post') {
            $plantao->regioes_id = $this->request->getPost('regioes_id');
            $plantao->plantonistas_id = $this->request->getPost('plantonistas_id');

            if ($plantoesModel->update($id, $plantao)) {