app/Controllers/Regioes.php

SELECT *
FROM `regioes`
---
    public function index()
    {
        $regioesModel = new \App\Models\RegioesModel();
        $data['regioes'] = $regioesModel->get()->getResult();

SELECT *
FROM `regioes`
WHERE `regioes`.`id` = '60'
---
    public function editar($id)
    {
        $data['msg'] = '';
        $data['title'] = 'Editar';
        $data['errors'] = '';
        $regioesModel = new \App\Models\RegioesModel();
        $regiao = $regioesModel->find($id);